Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НадбавкаЗаСложность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплатитьПремию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНачисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/НачислениеЗарплаты/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИРассчитать(Команда)
	
	// Проверка периодов шапки
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ПоказатьПредупреждение(, "Пожалуйста, заполните Дату начала и Дату окончания периода!");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДатаНачала > Объект.ДатаОкончания Тогда
		ПоказатьПредупреждение(, "Дата начала не может быть больше Даты окончания!");
		Возврат;
	КонецЕсли;
	
	// Вызываем серверный расчет
	ЗаполнитьИРассчитатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИРассчитатьНаСервере()
	
	Объект.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.Должность КАК Должность,
		|	Сотрудники.Должность.ТарифнаяСтавка КАК ТарифнаяСтавка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.ДатаПриема <= &ДатаОкончания
		|	И (Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Сотрудники.ДатаУвольнения >= &ДатаНачала)";
		
	Запрос.УстановитьПараметр("ДатаНачала", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.Должность = Выборка.Должность;
		НоваяСтрока.ТарифнаяСтавка = Выборка.ТарифнаяСтавка;
		НоваяСтрока.ОтработаноЧасов = 160; // Стандартное заполнение
		
		// По умолчанию галочки выключены
		НоваяСтрока.НадбавкаЗаСложность = Ложь;
		НоваяСтрока.ВыплатитьПремию   = Ложь;
		
		// Автоматически рассчитываем базовую сумму строки
		ПересчитатьСтрокуЗП(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСтрокуЗП(Строка)
	
	НормаВМесяц = 160;
	
	// 1. Расчет базового оклада от отработанных часов
	Если НормаВМесяц = 0 Тогда
		БазовыйОклад = 0;
	Иначе
		БазовыйОклад = (Строка.ТарифнаяСтавка / НормаВМесяц) * Строка.ОтработаноЧасов;
	КонецЕсли;
	
	БазовыйОклад = Окр(БазовыйОклад, 2);
	
	// 2. Расчет премии (+22.5% от оклада) по галочке ВыплатитьПремию
	Если Строка.ВыплатитьПремию Тогда
		СуммаПремии = Окр(БазовыйОклад * 0.225, 2); 
	Иначе
		СуммаПремии = 0;
	КонецЕсли;
	
	// 3. Расчет надбавки (+10% от оклада) по галочке НадбавкаЗаСложность
	Если Строка.НадбавкаЗаСложность Тогда
		СуммаСложности = Окр(БазовыйОклад * 0.10, 2);
	Иначе
		СуммаСложности = 0;
	КонецЕсли;
	
	// 4. Финальный результат падает в итоговую колонку
	Строка.СуммаНачисления = БазовыйОклад + СуммаПремии + СуммаСложности;
	
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ДЛЯ ЭКРАНА (Мгновенная реакция на твои клики)

&НаКлиенте
Процедура НачисленияОтработаноЧасовПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Начисления.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСтрокуЗП(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВыплатитьПремиюПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Начисления.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСтрокуЗП(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияНадбавкаЗаСложностьПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Начисления.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		ПересчитатьСтрокуЗП(ТекущаяСтрока);
	КонецЕсли;
КонецПроцедуры
